tut.ABLflatTerrain.precursor/system/sampling/boundaryData.northwest
      boundaryData
      {
          type                 surfaces;
          functionObjectLibs   ("libsampling.so");
          enabled              true;
          interpolationScheme  isThisNeeded;
          outputControl        timeStep;
          outputInterval       1;
          surfaceFormat        foamFile;
          fields
          (
              U
              T
              k
          );
          surfaces
          (
              north
              {
                  type         patch;
                  patches      (north);
                  triangulate  false;
              }
              west
              {
                  type         patch;
                  patches      (west);
                  triangulate  false;
              }
          );
      }
