tut.ABLflatTerrain.precursor/system/sampling/planarAveraging

      planarAveraging
      {
          #include            "../../setUp"
          type                 planarAveraging;
          functionObjectLibs   ("libSOWFAfieldFunctionObjects.so");
          enabled              true;
          writeControl         timeStep;
          writeInterval        $statisticsFrequency;
          fields
          (
              U
              T
              UU
              wUU
              TU
          );
      }
