tut.ABLflatTerrain.precursor/system/sampling/sliceDataInstantaneous
      sliceDataInstantaneous
      {
          type                 surfaces;
          functionObjectLibs   ("libsampling.so");
          enabled              true;
          interpolationScheme  cell;
          outputControl        adjustableTime;
          writeInterval        60;
          surfaceFormat        vtk;
          fields
          (
              U
              T
          );
          surfaces
          (
              slice_horizontal_z20
              {
                  type         plane;
                  basePoint    (1500.01 1500.01 20.01);
                  normalVector (0 0 1);
                  triangulate  false;
              }
              slice_horizontal_z80
              {
                  type         plane;
                  basePoint    (1500.01 1500.01 80.01);
                  normalVector (0 0 1);
                  triangulate  false;
              }
              slice_horizontal_z200
              {
                  type         plane;
                  basePoint    (1500.01 1500.01 200.01);
                  normalVector (0 0 1);
                  triangulate  false;
              }
              slice_cross_stream_y1500
              {
                  type         plane;
                  basePoint    (1500.01 1500.01 84.0);
                  normalVector (0 1 0);
                  triangulate  false;
              }
              slice_streamwise_x1500
              {
                  type         plane;
                  basePoint    (1500.01 1500.01 84.0);
                  normalVector (1 0 0);
                  triangulate  false;
              }
          );
      }
